{
    "dialogue": [
        {
            "name": "Yvyteph Hurrah",
            "image": "Yvyteph_FontOfFertility",
            "lines": [
                "Yes! Desire is second nature to you, I knew it. You are my daughter as surely as Qyvnily. Enough talk now; words of passion are a fine tease, but I require action!"
            ]
        },
        {
            "name": "Maya Determination",
            "image": "Maya_portraits_Sprite_Confused",
            "lines": [],
            "choices": [
                {
                    "text": "Okey-dokey",
                    "dialogue": [
                        {
                            "name": "Maya Evil Determination",
                            "image": "Maya_portraits_Sprite_Eldritch",
                            "lines": [
                                "Looking forward to it! My pursuer shall burn with Desire. *wink*"
                            ]
                        }
                    ]
                },
                {
                    "text": "No more games...",
                    "dialogue": [
                        {
                            "name": "Maya Good Determination",
                            "image": "Maya_portraits_Sprite_Angry",
                            "lines": [
                                "No more games! You want me to toss a treeman's egg into lava so that he'll jump in and burn to death in a desperate bid to save it, right?",
                                "Well nuts to that. I will not harm an innocent, even to save my own life. So you better think of something else for me to do or let me go or kill me, because I'm not doing that."
                            ]
                        },
                        {
                            "name": "Yvyteph Confusion",
                            "image": "Yvyteph_FontOfFertility",
                            "lines": [
                                "*shiver quiver* Such passion! I love your tribute, mortal daughter, but I long for the demonstration of your commitment to longing more. Do what must be done, or let the Reaper Treant claim you. Either would be amusing."
                            ]
                        },
                        {
                            "name": "Qyvnily Rescue",
                            "image": "Qyvnily_WildFlower",
                            "lines": [
                                "Wait, Mum! There's something important here. Maya, you said you would die before harming an innocent? Why?"
                            ]
                        },
                        {
                            "name": "Maya Good Determination",
                            "image": "Maya_portraits_Sprite_Happy",
                            "lines": [
                                "We call it 'compassion'. It's got 'passion' baked right into the loaf! It's the passion people have to care about other people's wellbeing and feelings, for kindness and love.",
                                "Not only does it help support a society of people and our interrelations, but it also allows us to thrill in actions that affect others more than ourselves; if these actions are good and constructive, we can have both a healthy society and exponentiate our communal passions by expanding our network of social influence.",
                                "Compassion is a key facet of passion to humans, at least as far as I'm concerned, and it's pretty rad. Perhaps you should learn about it."
                            ]
                        },
                        {
                            "name": "Qyvnily Desire",
                            "image": "Qyvnily_WildFlower",
                            "lines": [
                                "I WANT to know the feelings she describes, Mother. I think she's done with the trials."
                            ]
                        },
                        {
                            "name": "Yvyteph Satisfaction",
                            "image": "Yvyteph_FontOfFertility",
                            "lines": [
                                "You have stirred much in my daughter, Maya, and also something within me. I am too primordial to consider such high-minded philosophy, but perhaps even I can still learn new dimensions of Desire. It is certainly infinite.",
                                "Very well, you have passed our trials! I will grant you one of two wishes:",
                                "First, I can return you to Meigantu and your previous life. I will wipe out the serpentfolk who chase you that you may escape wherever you wish and live on as you see fit.",
                                "Alternatively, let go your old existence and join with me! Become an Angel of Desire and live forever in the stream of passion with me. You have proven to be quite insightful, and my daughter and I would benefit from your guidance. And I especially would appreciate your... companionship. I believe I did promise you a redefiniton of pleasure; I will only keep that promise if you stay. After all, no mortal could survive the ecstasy I will show you, so you must first ascend to divinity beside us.",
                                "Choose wisely and quickly! I Desire you, and if you are neither gone from here nor an angel in the next instant your mortal shell will not survive my passion."
                            ]
                        },
                        {
                            "name": "Maya Final Decision",
                            "image": "Maya_portraits_Sprite_Confused",
                            "lines": [
                                "*meep*"
                            ],
                            "choices": [
                                {
                                    "text": "I wanna go home!",
                                    "dialogue": [
                                        {
                                            "name": "Yvyteph DiSatisfaction",
                                            "image": "Yvyteph_FontOfFertility",
                                            "lines": [
                                                "Very well, mortal girl. You shall always be girlfish to me. Do not cross my path again, for I will not be able to hold back my Desire. I shall not even try."
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "text": "Let's do it!",
                                    "dialogue": [
                                        {
                                            "name": "Maya Amorous Angel",
                                            "image": "Maya_portraits_Sprite_Eldritch",
                                            "lines": [
                                                "All righty-roo, make me a demigoddess or whatever! I have a feeling Molly is going to need me on the squad with you guys."
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
                    
                
            
        
    ]
}
